# Capstone Project
### DATA 606, Spring 2022, Dr. Chaojie Wang
### David Fahnestock

#### Description: 
This notebook represents data cleansing to prepare the data for the three cities in a final form for Machine Learning.   

#### Dataset Sources:
<ul><li>New York City: <a href='https://ride.citibikenyc.com/system-data'>https://ride.citibikenyc.com/system-data</a> </li>
    <li>Chicago: <a href='https://ride.divvybikes.com/system-data'>https://ride.divvybikes.com/system-data</a> </li>
    <li>San Francisco: <a href='https://www.lyft.com/bikes/bay-wheels/system-data'>https://www.lyft.com/bikes/bay-wheels/system-data</a> </li>
</ul>

## Function Definitions & Setup
This section deals with imports and function definitions

In [1]:
import pandas as pd
pd.__version__

'1.3.4'

In [2]:
from matplotlib import pyplot as plt

In [3]:
import numpy as np

In [4]:
import glob

In [5]:
import os
from os.path import join, isdir
from os import mkdir, path

In [6]:
import datetime

In [7]:
# Import my helper py file to help with importing the data
import dfimporthelpers as imp

### Input Parameters
#### Set input parameter values that will be used for the analysis

In [8]:
# Used for chart labels
p_city_name = 'Chicago'

In [9]:
# Source directory of csv data files to analyze
p_src_directory = 'ChicagoData'

In [10]:
# Column names to be used when importing the data since some files use different names
# even though the columns are the same.  Set to None to use the columns names from the header in 
# each file.
p_column_names = None
#p_column_names = ['ride_id','started_at','ended_at','bikeid','tripduration','start_station_id',
#                'start_station_name','end_station_id','end_station_name','usertype','gender','birthyear']

<br><br>

# Load and Clean Bike Share data for each city

In [11]:
dir_path = '/Users/DF/Library/CloudStorage/OneDrive-Personal/Documents/' + \
           'Grad School-Davidâ€™s MacBook Pro/Spring 2022 - Capstone/JupyterNB/data/'

## Load Chicago data
#### First load the newer data, which uses a different field layout than the older data. This was determined through initial cleaning and then streamlined in this consolidated notebook.

In [12]:
# Load Chicago data that uses the latest field layout
full_path = dir_path + 'ChicagoData'
df_chicago = imp.load_csvs_to_df(src_dir=full_path, col_names=None)

In [13]:
df_chicago.head(5)

,ride_id,rideable_type,started_at,ended_at,start_station_name,start_station_id,end_station_name,end_station_id,start_lat,start_lng,end_lat,end_lng,member_casual
0,BD0A6FF6FFF9B921,electric_bike,2020-11-01 13:36:00,2020-11-01 13:45:40,Dearborn St & Erie St,110.0,St. Clair St & Erie St,211.0,41.894177,-87.629127,41.894434,-87.623379,casual
1,96A7A7A4BDE4F82D,electric_bike,2020-11-01 10:03:26,2020-11-01 10:14:45,Franklin St & Illinois St,672.0,Noble St & Milwaukee Ave,29.0,41.890959,-87.635343,41.900675,-87.662480,casual
2,C61526D06582BDC5,electric_bike,2020-11-01 00:34:05,2020-11-01 01:03:06,Lake Shore Dr & Monroe St,76.0,Federal St & Polk St,41.0,41.880983,-87.616754,41.872054,-87.629550,casual
3,E533E89C32080B9E,electric_bike,2020-11-01 00:45:16,2020-11-01 00:54:31,Leavitt St & Chicago Ave,659.0,Stave St & Armitage Ave,185.0,41.895499,-87.682013,41.917744,-87.691392,casual
4,1C9F4EF18C168C60,electric_bike,2020-11-01 15:43:25,2020-11-01 16:16:52,Buckingham Fountain,2.0,Buckingham Fountain,2.0,41.876497,-87.620358,41.876448,-87.620338,casual

#### Now Load the older data

In [14]:
# Load the older data that uses a different layout
full_path = dir_path + 'ChicagoData/Older'

column_names = ['ride_id','started_at','ended_at','bikeid','tripduration','start_station_id',
                'start_station_name','end_station_id','end_station_name','member_casual','gender','birthyear']

df_temp = imp.load_csvs_to_df(src_dir=full_path, col_names=column_names)

In [15]:
df_temp.head(5)

,ride_id,started_at,ended_at,bikeid,tripduration,start_station_id,start_station_name,end_station_id,end_station_name,member_casual,gender,birthyear
0,17536702,2018-01-01 00:12:00,2018-01-01 00:17:23,3304,323.0,69,Damen Ave & Pierce Ave,159,Claremont Ave & Hirsch St,Subscriber,Male,1988.0
1,17536703,2018-01-01 00:41:35,2018-01-01 00:47:52,5367,377.0,253,Winthrop Ave & Lawrence Ave,325,Clark St & Winnemac Ave (Temp),Subscriber,Male,1984.0
2,17536704,2018-01-01 00:44:46,2018-01-01 01:33:10,4599,"2,904.0",98,LaSalle St & Washington St,509,Troy St & North Ave,Subscriber,Male,1989.0
3,17536705,2018-01-01 00:53:10,2018-01-01 01:05:37,2302,747.0,125,Rush St & Hubbard St,364,Larrabee St & Oak St,Subscriber,Male,1983.0
4,17536706,2018-01-01 00:53:37,2018-01-01 00:56:40,3696,183.0,129,Blue Island Ave & 18th St,205,Paulina St & 18th St,Subscriber,Male,1989.0

In [16]:
# View data
df_chicago.dtypes

ride_id                object
rideable_type          object
started_at             object
ended_at               object
start_station_name     object
start_station_id       object
end_station_name       object
end_station_id         object
start_lat             float64
start_lng             float64
end_lat               float64
end_lng               float64
member_casual          object
dtype: object

In [17]:
df_temp.dtypes

ride_id                 int64
started_at             object
ended_at               object
bikeid                  int64
tripduration           object
start_station_id        int64
start_station_name     object
end_station_id          int64
end_station_name       object
member_casual          object
gender                 object
birthyear             float64
dtype: object

#### Combine the two Chicago dataframes then we'll update field types further

#### Get row counts of each before we combine them

In [18]:
df_temp.shape

(11250100, 12)

In [19]:
df_chicago.shape

(9136746, 13)

In [20]:
df_chicago = pd.concat([df_temp, df_chicago])

In [21]:
# How many rows and columns
print('rows:', df_chicago.shape[0])
print('columns:', df_chicago.shape[1])

rows: 20386846
columns: 17

#### Add a field to indicate this is from Chicago.  This will be useful when we combine all the cities together.

In [22]:
df_chicago['city'] = 'Chicago'

In [23]:
df_chicago.head()

,ride_id,started_at,ended_at,bikeid,tripduration,start_station_id,start_station_name,end_station_id,end_station_name,member_casual,gender,birthyear,rideable_type,start_lat,start_lng,end_lat,end_lng,city
0,17536702,2018-01-01 00:12:00,2018-01-01 00:17:23,3304.0,323.0,69,Damen Ave & Pierce Ave,159,Claremont Ave & Hirsch St,Subscriber,Male,1988.0,NaN,NaN,NaN,NaN,NaN,Chicago
1,17536703,2018-01-01 00:41:35,2018-01-01 00:47:52,5367.0,377.0,253,Winthrop Ave & Lawrence Ave,325,Clark St & Winnemac Ave (Temp),Subscriber,Male,1984.0,NaN,NaN,NaN,NaN,NaN,Chicago
2,17536704,2018-01-01 00:44:46,2018-01-01 01:33:10,4599.0,"2,904.0",98,LaSalle St & Washington St,509,Troy St & North Ave,Subscriber,Male,1989.0,NaN,NaN,NaN,NaN,NaN,Chicago
3,17536705,2018-01-01 00:53:10,2018-01-01 01:05:37,2302.0,747.0,125,Rush St & Hubbard St,364,Larrabee St & Oak St,Subscriber,Male,1983.0,NaN,NaN,NaN,NaN,NaN,Chicago
4,17536706,2018-01-01 00:53:37,2018-01-01 00:56:40,3696.0,183.0,129,Blue Island Ave & 18th St,205,Paulina St & 18th St,Subscriber,Male,1989.0,NaN,NaN,NaN,NaN,NaN,Chicago

In [24]:
df_chicago = df_chicago[['started_at','ended_at','city']].copy()

## Load San Francisco data
#### First load the newer data, which uses a different field layout than the older data. This was determined through initial cleaning and then streamlined in this consolidated notebook.

In [25]:
# Load Chicago data that uses the latest field layout
full_path = dir_path + 'SanFranciscoData'
df_sanfrancisco = imp.load_csvs_to_df(src_dir=full_path, col_names=None)

In [26]:
df_sanfrancisco.dtypes

ride_id                object
rideable_type          object
started_at             object
ended_at               object
start_station_name     object
start_station_id       object
end_station_name       object
end_station_id         object
start_lat             float64
start_lng             float64
end_lat               float64
end_lng               float64
member_casual          object
dtype: object

#### Now Load the older data

In [27]:
# Load the older data that uses a different layout
full_path = dir_path + 'SanFranciscoData/Older'

column_names = ['duration','started_at','ended_at','start_station_id',
                'start_station_name','start_lat','start_lng','end_station_id','end_station_name',
                'end_lat','end_lng','bike_id','member_casual','rental_access_method']

df_temp = imp.load_csvs_to_df(src_dir=full_path, col_names=column_names)

In [28]:
df_temp.dtypes

duration                 object
started_at               object
ended_at                 object
start_station_id         object
start_station_name       object
start_lat               float64
start_lng               float64
end_station_id           object
end_station_name         object
end_lat                 float64
end_lng                 float64
bike_id                  object
member_casual            object
rental_access_method     object
dtype: object

In [29]:
# View data
df_sanfrancisco.dtypes

ride_id                object
rideable_type          object
started_at             object
ended_at               object
start_station_name     object
start_station_id       object
end_station_name       object
end_station_id         object
start_lat             float64
start_lng             float64
end_lat               float64
end_lng               float64
member_casual          object
dtype: object

#### Combine the two dataframes then we'll update field types further

#### Get row counts of each before we combine them

In [30]:
df_temp.shape

(5795411, 14)

In [31]:
df_sanfrancisco.shape

(3275783, 13)

In [32]:
df_sanfrancisco = pd.concat([df_temp, df_sanfrancisco])

In [33]:
# How many rows and columns
print('rows:', df_sanfrancisco.shape[0])
print('columns:', df_sanfrancisco.shape[1])

rows: 9071194
columns: 16

#### Add a field to indicate the city.  This will be useful when we combine all the cities together.

In [34]:
df_sanfrancisco['city'] = 'San Francisco'

In [35]:
df_sanfrancisco.dtypes

duration                 object
started_at               object
ended_at                 object
start_station_id         object
start_station_name       object
start_lat               float64
start_lng               float64
end_station_id           object
end_station_name         object
end_lat                 float64
end_lng                 float64
bike_id                  object
member_casual            object
rental_access_method     object
ride_id                  object
rideable_type            object
city                     object
dtype: object

In [36]:
# View the combined df
df_sanfrancisco.head()

,duration,started_at,ended_at,start_station_id,start_station_name,start_lat,start_lng,end_station_id,end_station_name,end_lat,end_lng,bike_id,member_casual,rental_access_method,ride_id,rideable_type,city
0,598,2018-02-28 23:59:47.0970,2018-03-01 00:09:45.1870,284,Yerba Buena Center for the Arts (Howard St at ...,37.784872,-122.400876,114,Rhode Island St at 17th St,37.764478,-122.402570,1035,Subscriber,No,NaN,NaN,San Francisco
1,943,2018-02-28 23:21:16.4950,2018-02-28 23:36:59.9740,6,The Embarcadero at Sansome St,37.804770,-122.403234,324,Union Square (Powell St at Post St),37.788300,-122.408531,1673,Customer,No,NaN,NaN,San Francisco
2,18587,2018-02-28 18:20:55.1900,2018-02-28 23:30:42.9250,93,4th St at Mission Bay Blvd S,37.770407,-122.391198,15,San Francisco Ferry Building (Harry Bridges Pl...,37.795392,-122.394203,3498,Customer,No,NaN,NaN,San Francisco
3,18558,2018-02-28 18:20:53.6210,2018-02-28 23:30:12.4500,93,4th St at Mission Bay Blvd S,37.770407,-122.391198,15,San Francisco Ferry Building (Harry Bridges Pl...,37.795392,-122.394203,3129,Customer,No,NaN,NaN,San Francisco
4,885,2018-02-28 23:15:12.8580,2018-02-28 23:29:58.6080,308,San Pedro Square,37.336802,-121.894090,297,Locust St at Grant St,37.322980,-121.887931,1839,Subscriber,Yes,NaN,NaN,San Francisco

In [37]:
df_sanfrancisco = df_sanfrancisco[['started_at','ended_at','city']].copy()

## Load New York City data
#### First load the newer data, which uses a different field layout than the older data. This was determined through initial cleaning and then streamlined in this consolidated notebook.

In [38]:
# Load data that uses the latest field layout
full_path = dir_path + 'NYCData'
df_nyc = imp.load_csvs_to_df(src_dir=full_path, col_names=None)

In [39]:
df_nyc.head(5)

,ride_id,rideable_type,started_at,ended_at,start_station_name,start_station_id,end_station_name,end_station_id,start_lat,start_lng,end_lat,end_lng,member_casual
0,E12103A91226099A,docked_bike,2021-05-06 17:25:01,2021-05-06 17:45:25,Broadway & W 60 St,6948.11,1 Ave & E 78 St,7020.09,40.769155,-73.981918,40.771404,-73.953517,member
1,26A3DC47FE0EA3A3,docked_bike,2021-05-13 12:48:08,2021-05-13 13:07:37,Broadway & W 25 St,6173.08,E 2 St & Avenue B,5515.02,40.742868,-73.989186,40.722174,-73.983688,member
2,A99F2E1D627B088F,docked_bike,2021-05-16 08:30:13,2021-05-16 08:45:47,46 Ave & 5 St,6286.02,34th Ave & Vernon Blvd,6873.01,40.747310,-73.954510,40.765354,-73.939863,member
3,43E79A45997B7390,docked_bike,2021-05-01 08:38:14,2021-05-01 08:54:27,46 Ave & 5 St,6286.02,34th Ave & Vernon Blvd,6873.01,40.747310,-73.954510,40.765354,-73.939863,member
4,8B3CC649F4F58816,docked_bike,2021-05-09 08:12:31,2021-05-09 08:27:05,46 Ave & 5 St,6286.02,34th Ave & Vernon Blvd,6873.01,40.747310,-73.954510,40.765354,-73.939863,member

#### Now Load the older data

In [40]:
# Load the older data that uses a different layout
full_path = dir_path + 'NYCData/Older'

column_names = ['duration','started_at','ended_at','start_station_id',
                'start_station_name','start_lat','start_lng','end_station_id','end_station_name',
                'end_lat','end_lng','bike_id','member_casual','birthyear','gender']

df_temp = imp.load_csvs_to_df(src_dir=full_path, col_names=column_names)

In [41]:
df_temp.head(5)

,duration,started_at,ended_at,start_station_id,start_station_name,start_lat,start_lng,end_station_id,end_station_name,end_lat,end_lng,bike_id,member_casual,birthyear,gender
0,362,2017-09-01 00:00:17,2017-09-01 00:06:19,3331.0,Riverside Dr & W 104 St,40.801343,-73.971146,3328.0,W 100 St & Manhattan Ave,40.795000,-73.964500,14530,Subscriber,1993.0,1
1,188,2017-09-01 00:00:21,2017-09-01 00:03:30,3101.0,N 12 St & Bedford Ave,40.720798,-73.954847,3100.0,Nassau Ave & Newell St,40.724813,-73.947526,15475,Subscriber,1988.0,1
2,305,2017-09-01 00:00:25,2017-09-01 00:05:30,3140.0,1 Ave & E 78 St,40.771404,-73.953517,3141.0,1 Ave & E 68 St,40.765005,-73.958185,30346,Subscriber,1969.0,1
3,223,2017-09-01 00:00:52,2017-09-01 00:04:36,236.0,St Marks Pl & 2 Ave,40.728419,-73.987140,473.0,Rivington St & Chrystie St,40.721101,-73.991925,28056,Subscriber,1993.0,1
4,758,2017-09-01 00:01:01,2017-09-01 00:13:40,3427.0,Lafayette St & Jersey St,40.724305,-73.996010,3431.0,E 35 St & 3 Ave,40.746524,-73.977885,25413,Subscriber,1987.0,1

In [42]:
# View data
df_nyc.dtypes

ride_id                object
rideable_type          object
started_at             object
ended_at               object
start_station_name     object
start_station_id       object
end_station_name       object
end_station_id         object
start_lat             float64
start_lng             float64
end_lat               float64
end_lng               float64
member_casual          object
dtype: object

In [43]:
df_temp.dtypes

duration                int64
started_at             object
ended_at               object
start_station_id      float64
start_station_name     object
start_lat             float64
start_lng             float64
end_station_id        float64
end_station_name       object
end_lat               float64
end_lng               float64
bike_id                 int64
member_casual          object
birthyear             float64
gender                  int64
dtype: object

#### Combine the two dataframes then we'll update field types further

#### Get row counts of each before we combine them

In [44]:
df_temp.shape

(75066896, 15)

In [45]:
df_nyc.shape

(26564473, 13)

In [46]:
df_nyc = pd.concat([df_temp, df_nyc])

In [47]:
# How many rows and columns
print('rows:', df_nyc.shape[0])
print('columns:', df_nyc.shape[1])

rows: 101631369
columns: 17

#### Add a field to indicate this is from Chicago.  This will be useful when we combine all the cities together.

In [48]:
df_nyc['city'] = 'NYC'

In [49]:
df_nyc.dtypes

duration              float64
started_at             object
ended_at               object
start_station_id       object
start_station_name     object
start_lat             float64
start_lng             float64
end_station_id         object
end_station_name       object
end_lat               float64
end_lng               float64
bike_id               float64
member_casual          object
birthyear             float64
gender                float64
ride_id                object
rideable_type          object
city                   object
dtype: object

In [50]:
df_nyc = df_nyc[['started_at','ended_at','city']].copy()

### Finally, combine all City Dataframes into One

In [51]:
df_all = pd.concat([df_chicago,df_sanfrancisco,df_nyc])

In [52]:
# How many rows and columns do we have
df_all.shape

(131089409, 3)

In [63]:
del df_nyc
del df_chicago
del df_sanfrancisco

In [62]:
df_temp.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
Int64Index: 131089409 entries, 0 to 649982
Data columns (total 3 columns):
 #   Column      Dtype
---  ------      -----
 0   started_at  datetime64[ns]
 1   ended_at    datetime64[ns]
 2   city        object
dtypes: datetime64[ns](2), object(1)
memory usage: 10.4 GB

<br>

## Clean and prepare the data

#### Look at the data field types

In [53]:
df_all.dtypes

started_at    object
ended_at      object
city          object
dtype: object

In [54]:
df_all.head()

            started_at             ended_at     city
0  2018-01-01 00:12:00  2018-01-01 00:17:23  Chicago
1  2018-01-01 00:41:35  2018-01-01 00:47:52  Chicago
2  2018-01-01 00:44:46  2018-01-01 01:33:10  Chicago
3  2018-01-01 00:53:10  2018-01-01 01:05:37  Chicago
4  2018-01-01 00:53:37  2018-01-01 00:56:40  Chicago

<br />

## Create cleaned version with only the attributes we will use for ML

In [56]:
# Based on the prevalence of nulls in these fields, we will discard them from our analysis
# and only use these fields
df_clean = df_all

In [57]:
# Convert date/times
df_clean['started_at'] = pd.to_datetime(df_clean['started_at'])
df_clean['ended_at']   = pd.to_datetime(df_clean['ended_at'])

#### Create calculated field with trip durations

In [64]:
df_clean['duration_minutes'] = (df_clean['ended_at'] - df_clean['started_at']) / pd.Timedelta(minutes=1)

#### Let's add separate columns for Month#, Year, Hour for further analysis

In [65]:
df_clean['year']       = pd.DatetimeIndex(df_clean['started_at']).year
df_clean['month']      = pd.DatetimeIndex(df_clean['started_at']).month
df_clean['year-month'] = df_clean['started_at'].dt.strftime('%Y-%m')
df_clean['start_date'] = df_clean['started_at'].dt.strftime('%Y-%m-%d')

In [66]:
# Check to be sure we have addressed the nulls
df_clean.isnull().sum()

started_at              0
ended_at            58970
city                    0
duration_minutes    58970
year                    0
month                   0
year-month              0
start_date              0
dtype: int64

In [67]:
# The remaining nulls are minimal.  Therefore, we will remove those rows for analysis purposes
df_clean = df_clean.dropna()

In [68]:
df_clean.head()

,started_at,ended_at,city,duration_minutes,year,month,year-month,start_date
0,2018-01-01 00:12:00,2018-01-01 00:17:23,Chicago,5.383333,2018,1,2018-01,2018-01-01
1,2018-01-01 00:41:35,2018-01-01 00:47:52,Chicago,6.283333,2018,1,2018-01,2018-01-01
2,2018-01-01 00:44:46,2018-01-01 01:33:10,Chicago,48.400000,2018,1,2018-01,2018-01-01
3,2018-01-01 00:53:10,2018-01-01 01:05:37,Chicago,12.450000,2018,1,2018-01,2018-01-01
4,2018-01-01 00:53:37,2018-01-01 00:56:40,Chicago,3.050000,2018,1,2018-01,2018-01-01

In [69]:
df_clean.dtypes

started_at          datetime64[ns]
ended_at            datetime64[ns]
city                        object
duration_minutes           float64
year                         int64
month                        int64
year-month                  object
start_date                  object
dtype: object

### Group by city and date

In [70]:
# Group the results by city and date
df_grouped = df_clean.groupby(['city','start_date','year','month','year-month']).agg( \
                              {'started_at':'count','duration_minutes':'sum'}).copy().reset_index()

In [71]:
# Rename count to be "#trips"
df_grouped.rename(columns={'started_at':'#trips'}, inplace=True)

In [72]:
df_grouped.head(10)

      city  start_date  year  month year-month  #trips  duration_minutes
0  Chicago  2017-01-01  2017      1    2017-01    1727      25880.733333
1  Chicago  2017-01-02  2017      1    2017-01    1960      20142.733333
2  Chicago  2017-01-03  2017      1    2017-01    4537      47873.266667
3  Chicago  2017-01-04  2017      1    2017-01    3269      33301.583333
4  Chicago  2017-01-05  2017      1    2017-01    2917      26602.916667
5  Chicago  2017-01-06  2017      1    2017-01    2516      22929.633333
6  Chicago  2017-01-07  2017      1    2017-01    1330      15111.516667
7  Chicago  2017-01-08  2017      1    2017-01    1193      13331.916667
8  Chicago  2017-01-09  2017      1    2017-01    3816      38191.533333
9  Chicago  2017-01-10  2017      1    2017-01    3310      35199.700000


### Save the final combined to a csv so we don't have to repeat the time-consuming above steps when  using in machine learning

In [73]:
dir_path = '/Users/DF/Library/CloudStorage/OneDrive-Personal/Documents/' + \
           'Grad School-Davidâ€™s MacBook Pro/Spring 2022 - Capstone/JupyterNB/'

os.chdir(dir_path)

In [74]:
df_grouped.to_csv('nyc_chicago_sf_tripsbydate_2017to2021.csv', index=False)